#ifndef ALhead_内存
#define ALhead_内存

// **************************************************************************
// 函数原型声明

/// @brief 复制一段内存复制到另一段内存
/// @param 复制源_地址 复制内存的源地址
/// @param 复制目标_地址 复制内存的目标地址
/// @param 复制_元素数量 复制内存的元素数量
void *mem_cpy(const void *复制源_地址, void *复制目标_地址, unsigned long long 复制_元素数量);

// **************************************************************************
// 函数定义

void *mem_cpy(const void *复制源_地址, void *复制目标_地址, unsigned long long 复制_字节数) {
  // 初始化_首
  unsigned long long i_1;
  const char *复制源_地址_2 = 复制源_地址;
  char *复制目标_地址_2 = 复制目标_地址;
  // 开始执行
  for(i_1 = 0; i_1 < 复制_字节数; i_1++) {
    *(复制目标_地址_2++) = *(复制源_地址_2++);
  }
  // 结束
  return (复制目标_地址);
}

#endif // ALhead_内存
