#include <stdio.h>
#include <stdlib.h>

// ***********************************************************************
// 函数原型声明

int main(void);

// ***********************************************************************
// 函数定义

int main(void) {
  // 初始化
  char *p[100];
  int i_1;
  // 初始化_次
  i_1 = 0;
  // 开始执行
  while(1) {
    p[i_1] = malloc(1024 * 1024 * 100);
    if(p[i_1] != 0) {
      printf("申请了%d00MB内存:0x%p\n", i_1, (void *)p[i_1]);
    }
    else {
      printf("已经到达上限");
      break;
    }
    i_1++;
  }
  // 结束
  return (0);
}
